class 店长:
    特点 = "只能用钱回复自己的血量"
    def __init__(self,血量,名字,伤害,几回合攻击一次,一次发射几颗子弹):
        self._血量 = 血量
        self.名字 = 名字
        self.伤害 = 伤害
        self.几回合攻击一次 = 几回合攻击一次
        self.一次发射几颗子弹 = 一次发射几颗子弹
        self.攻击冷却 = 0
    def __sub__(self,其他):
        print(f"{self.名字}攻击了{其他.名字}")
        总伤害 = self.伤害 * self.一次发射几颗子弹
        print(f"{self.名字}造成了{self.伤害 * self.一次发射几颗子弹}点伤害")    
        其他.血量 -= 总伤害
        print (f"{其他.名字}还剩{其他.血量}点血量")
        if 其他.血量<=0:
            print(f"{其他.名字}死了😱")
    def __str__(self):
        return f"{self.名字}血量:{self.血量}"
    def 可以攻击(self):
        if not self.是否存活:
            return False
            
        if self.攻击冷却 == 0:
            self.攻击冷却 = self.几回合攻击一次 - 1
            return True
        elif self.攻击冷却 > 0:
            print(f"本回合{self.名字}无法攻击")
            self.攻击冷却 -= 1
            return False
        return True    
    @property
    def 血量(self):
        return self._血量       
    @血量.setter
    def 血量(self,值):
        if 值 < 0:
            self._血量 = 0
        else:
            self._血量 = 值    
                    
    @property
    def 是否存活(self):
        if self._血量 > 0:
            return True
        else:
            return False    
                
    
class 战斗:
    def __init__(self,a,b):
        self.a = a
        self.b = b
        self.当前回合 = 0
    def __enter__(self):
        print("=" * 20)
        print(f"{self.a} vs {self.b}") 
        return self
    def __exit__(self,exc_type,exc_val,exc_tb):
        print("结束")
        print("=" * 20)
        return False
    def 回合(self):
        self.当前回合 += 1 
        print("="* 20)
        print(f"当前回合{self.当前回合}")
        if hasattr(self.a,'计算爆炸'):
            self.a.计算爆炸()
        if hasattr(self.b,'计算爆炸'):
            self.b.计算爆炸()    
        if self.a.可以攻击() and self.a.是否存活:
            if hasattr(self.a,'攻击'):
                self.a.攻击(self.b)
            else:    
                self.a - self.b
            if not self.b.是否存活:
                return False
        if self.b.可以攻击() and self.b.是否存活:
            
            if hasattr(self.b,'攻击'):
                self.a.攻击(self.b)
            else:    
                self.a - self.b
            if not self.a.是否存活:
                return False        
        return True
          
    
    
    
小店长 = 店长(30,"小店长",3,2,3)
堕化店长 = 店长(20,"堕化店长",3,3,4)

with 战斗(小店长,堕化店长) as 战斗aa:
    战斗继续 = True
    while 战斗继续:
        战斗继续 = 战斗aa.回合()
        
        
        
print("\n"*10)
print(小店长.血量)      
堕化店长.血量 = 30
小店长.血量 = 30
print(小店长)
print(堕化店长)
print(小店长.血量)
print(堕化店长.血量)
堕化店长.攻击冷却 = 0
小店长.攻击冷却 = 0
print("\n"*10) 
with 战斗(小店长,堕化店长) as 战斗aa:
    战斗继续 = True
    while 战斗继续:
        战斗继续 = 战斗aa.回合()
class 以撒(店长):
    特点 = "自带一颗炸弹💣" 
    def __init__(self,血量,名字,伤害,几回合攻击一次,一次发射几颗子弹):
        super().__init__(血量,名字,伤害,几回合攻击一次,一次发射几颗子弹)
        self.炸弹数量 = 1
        #炸弹无视护甲
        self.炸弹伤害 = 10
        self.炸弹倒计时 = 0
        self.爆炸时间 = 3
        self.炸弹目标 = None
        self.已放置炸弹 = False
    def 使用炸弹(self,目标):
        if self.炸弹数量 <= 0:
            print("没有炸弹了！")
            return False
        if self.已放置炸弹:
            print("已放置炸弹无法重复放置")
            return False
        if self.炸弹倒计时 == self.爆炸时间:
            print(f"炸弹还有{self.炸弹倒计时}回合的时间爆炸")
            
            
        self.炸弹数量 -= 1
        self.已放置炸弹 = True
        self.炸弹目标 = 目标
        self.炸弹倒计时 = self.爆炸时间
        return True
    def 计算爆炸(self):
        if not self.已放置炸弹 or self.炸弹目标 is None:  
            return False
        self.炸弹倒计时 -= 1
        if self.炸弹倒计时 > 0:
            print(f"炸弹还有{self.炸弹倒计时}回合爆炸")
            return False
        else:
            print("炸弹爆炸了😱")
            print(f"{self.炸弹目标.名字}受到{self.炸弹伤害}点无视护甲的伤害")  
            self.炸弹目标.血量 -= self.炸弹伤害          
            self.已放置炸弹 = False
            self.炸弹目标 = None
            return True
    def 攻击(self,目标):
        if self.炸弹数量 > 0 and self.已放置炸弹 is False:
            self.使用炸弹(目标)
            self.攻击冷却 = self.几回合攻击一次 - 1
        else:
            super().__sub__(目标)
            self.攻击冷却 = self.几回合攻击一次 - 1
    def __str__(self):
        base_info =  super().__str__()
        炸弹状态 = ""
        if self.已放置炸弹 and self.炸弹目标:
            炸弹状态 = f"{self.炸弹倒计时}回合"
        return f"{base_info}炸弹:{self.炸弹数量}颗{炸弹状态}"             
       
           
小以撒 = 以撒(60,"小以撒",1,1,1)        
print(小以撒)
print("\n"*20)
小店长.血量 = 30
小店长.攻击冷却 = 0
with 战斗(小以撒,小店长) as 战斗aa:
    战斗继续 = True
    while 战斗继续:
        战斗继续 = 战斗aa.回合()                  